; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-2)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	city0 - city
	city1 - city
	city2 - city
	)
(:init
	(at plane1 city1)
	(= (capacity plane1) 9256)
	(= (fuel plane1) 2411)
	(= (slow-burn plane1) 3)
	(= (fast-burn plane1) 6)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 9)
	(at plane2 city0)
	(= (capacity plane2) 11620)
	(= (fuel plane2) 3885)
	(= (slow-burn plane2) 5)
	(= (fast-burn plane2) 18)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 4)
	(at plane3 city0)
	(= (capacity plane3) 2606)
	(= (fuel plane3) 846)
	(= (slow-burn plane3) 1)
	(= (fast-burn plane3) 2)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 10)
	(at person1 city0)
	(at person2 city0)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 737)
	(= (distance city0 city2) 826)
	(= (distance city1 city0) 737)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 587)
	(= (distance city2 city0) 826)
	(= (distance city2 city1) 587)
	(= (distance city2 city2) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city0)
	(at plane2 city1)
	(at person1 city0)
	(at person2 city2)
	))

(:metric minimize (+ (* 3 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (fly plane1 city1 city0)
   deleted: (at plane1 city1)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 0 to 2211, (fuel plane1) from 2411 to 200
   goals met: 2 of 4
2. (fly plane2 city0 city1)
   deleted: (at plane2 city0)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 2211 to 5896, (fuel plane2) from 3885 to 200
   goals met: 3 of 4
3. (board person2 plane3 city0)
   deleted: (at person2 city0)
   added: (in person2 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 3 of 4
4. (fly plane3 city0 city2)
   deleted: (at plane3 city0)
   added: (at plane3 city2)
   changed: (total-fuel-used) from 5896 to 6722, (fuel plane3) from 846 to 20
   goals met: 3 of 4
5. (debark person2 plane3 city2)
   deleted: (in person2 plane3)
   added: (at person2 city2)
   changed: (onboard plane3) from 1 to 0
   goals met: 4 of 4
